blasius_laminar_github/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    zeroGradientPlanes
    {
        type            zeroGradient;
    }

    plate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {	
        type            fixedValue;
	value		uniform (1 0 0);
    }

   // rightSide
   // {
   //     type            zeroGradient;
   // }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
